Tekla Open API Reference for Tekla Structures 2025
ParametricProfileItem.GetParametricProfilePrefix Method
 Gets the parametric profile item prefix using the given subtype. This can be used after retrieving a library profile that has a parametric user-defined type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetParametricProfilePrefix(
	int Subtype
)
Public Shared Function GetParametricProfilePrefix (
	Subtype As Integer
) As String
Parameters
Subtype
Type: System.Int32
The profile item subtype.
Return Value
Type: String
The parametric profile item prefix.
See Also
Reference
ParametricProfileItem Class
Tekla.Structures.Catalogs Namespace